In [1]:
import pandas as pd
import numpy as np

/anaconda/envs/py35/lib/python3.5/importlib/_bootstrap.py:222: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/anaconda/envs/py35/lib/python3.5/importlib/_bootstrap.py:222: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

# Read Data

In [2]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns=['Col1','Col2','Col3','Col4'])

In [3]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

# Dataframe elements

In [6]:
df.describe()

            Col1       Col2       Col3       Col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
Col1    5 non-null int64
Col2    5 non-null int64
Col3    5 non-null int64
Col4    5 non-null int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [122]:
df = pd.DataFrame({"A":["sofia", 5, 8, 11, 100], 
                   "B":[2, 8, 77, 4, 11], 
                   "C":["amy", 11, 4, 6, 9]}) 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
A    5 non-null object
B    5 non-null int64
C    5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [124]:
df

       A   B    C
0  sofia   2  amy
1      5   8   11
2      8  77    4
3     11   4    6
4    100  11    9

In [125]:
df_new = df[1:]

In [126]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
A    4 non-null object
B    4 non-null int64
C    4 non-null object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes

In [127]:
df_new.infer_objects().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
A    4 non-null int64
B    4 non-null int64
C    4 non-null int64
dtypes: int64(3)
memory usage: 180.0 bytes

# Write to csv

In [5]:
df.to_csv('Test1.csv')

# Check Nulls

In [8]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [128]:
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
df = pd.DataFrame(dict) 
df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [129]:
# Access not nulls
bool_series = pd.notnull(df["First Score"])
df[bool_series]

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
3         95.0           NaN         98.0

In [130]:
# filling null value with previous ones   
df.fillna(method ='pad') 
#add attribute inplace=True if want to change the dataframe,like -
# df.fillna(method ='pad', inplace=True)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [131]:
# filling null value with the next ones   
df.fillna(method ='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [132]:
# replcae null values
df.replace(to_replace = np.nan, value = 99)

   First Score  Second Score  Third Score
0        100.0          30.0         99.0
1         90.0          45.0         40.0
2         99.0          56.0         80.0
3         95.0          99.0         98.0

In [133]:
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
df = pd.DataFrame(dict) 
df.isna()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [134]:
df.notna()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

# Drop nulls

In [14]:
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
df = pd.DataFrame(dict) 
df

   First Score  Fourth Score  Second Score  Third Score
0        100.0           NaN          30.0         52.0
1          NaN           NaN           NaN          NaN
2          NaN           NaN          45.0         80.0
3         95.0          65.0          56.0         98.0

In [15]:
# Drop row with all nulls
df.dropna(how = 'all')

   First Score  Fourth Score  Second Score  Third Score
0        100.0           NaN          30.0         52.0
2          NaN           NaN          45.0         80.0
3         95.0          65.0          56.0         98.0

In [16]:
dict = {'First Score':[100, 10, 40, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
df = pd.DataFrame(dict)    
df

   First Score  Fourth Score  Second Score  Third Score
0          100           NaN          30.0         52.0
1           10           NaN           NaN          NaN
2           40           NaN          45.0         80.0
3           95          65.0          56.0         98.0

In [17]:
# Drop all null columns
df.dropna(axis = 1)

   First Score
0          100
1           10
2           40
3           95

In [18]:
# Drop rows with any nulls
df.dropna(axis = 0, how ='any')

   First Score  Fourth Score  Second Score  Third Score
3           95          65.0          56.0         98.0

In [19]:
# Interpolate

df = pd.DataFrame({"A":[12, 4, 5, None, 1],  
                   "B":[None, 2, 54, 3, None],  
                   "C":[20, 16, None, 3, 8],  
                   "D":[14, 3, None, None, 6]})  
df

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

In [20]:
df.interpolate(method ='linear', limit_direction ='forward') 
# As we can see the output, values in the first row could not get filled as the direction of filling of values is forward and there is no previous value which could have been used in interpolation.

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   9.5   4.0
3   3.0   3.0   3.0   5.0
4   1.0   3.0   8.0   6.0

# Deal with rows columns - Series, DataFrames

In [21]:
df = pd.read_csv('Test1.csv') # sep is attrubute to provide separator if there is anything else than comma(,) like sep=';'
df.head()

  Unnamed: 0  Col1  Col2  Col3  Col4
0       Row1     0     1     2     3
1       Row2     4     5     6     7
2       Row3     8     9    10    11
3       Row4    12    13    14    15
4       Row5    16    17    18    19

In [22]:
# Returns Dataframe
df[['Col1']]

   Col1
0     0
1     4
2     8
3    12
4    16

In [23]:
# Returns Dataframe
df[['Col1','Col2']]

   Col1  Col2
0     0     1
1     4     5
2     8     9
3    12    13
4    16    17

In [24]:
# Returns Series
df['Col1']

0     0
1     4
2     8
3    12
4    16
Name: Col1, dtype: int64

In [28]:
print(type(df['Col1']))
print(type(df[['Col1']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [29]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

In [30]:
df[df['Col1']>4]

  Unnamed: 0  Col1  Col2  Col3  Col4
2       Row3     8     9    10    11
3       Row4    12    13    14    15
4       Row5    16    17    18    19

### Add Column

In [207]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
df = pd.DataFrame(data) 
df

   Height    Name Qualification
0     5.1     Jai           Msc
1     6.2  Princi            MA
2     5.1  Gaurav           Msc
3     5.2    Anuj           Msc

In [208]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna'] 
df['Address'] = address 
df

   Height    Name Qualification    Address
0     5.1     Jai           Msc      Delhi
1     6.2  Princi            MA  Bangalore
2     5.1  Gaurav           Msc    Chennai
3     5.2    Anuj           Msc      Patna

### Delete Column

In [209]:
df.drop(["Qualification"], axis = 1, inplace = True)

In [210]:
df

   Height    Name    Address
0     5.1     Jai      Delhi
1     6.2  Princi  Bangalore
2     5.1  Gaurav    Chennai
3     5.2    Anuj      Patna

### Delete Rows

In [212]:
df.drop([0])

   Height    Name    Address
1     6.2  Princi  Bangalore
2     5.1  Gaurav    Chennai
3     5.2    Anuj      Patna

# Indexing elements
#### 1. df.[]
#### 2. df.loc[]
#### 3. df.iloc[]
#### 4. df.ix[]

In [74]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc'],
        'Address': ['Delhi', 'Bangalore', 'Chennai', 'Patna']} 
df = pd.DataFrame(data) 
df

     Address  Height    Name Qualification
0      Delhi     5.1     Jai           Msc
1  Bangalore     6.2  Princi            MA
2    Chennai     5.1  Gaurav           Msc
3      Patna     5.2    Anuj           Msc

In [76]:
first = df["Name"] 
first #Series

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [78]:
first = df[["Name","Address"]]
first #Dataframe

     Name    Address
0     Jai      Delhi
1  Princi  Bangalore
2  Gaurav    Chennai
3    Anuj      Patna

### loc : This function selects data by the label of the rows and columns. The df.loc indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns.

In [84]:
second = df.loc[0]
second

Address          Delhi
Height             5.1
Name               Jai
Qualification      Msc
Name: 0, dtype: object

In [85]:
second = df.loc[[0,1]]
second

     Address  Height    Name Qualification
0      Delhi     5.1     Jai           Msc
1  Bangalore     6.2  Princi            MA

In [86]:
second = df.loc[[0,1],['Name','Address']]
second

     Name    Address
0     Jai      Delhi
1  Princi  Bangalore

In [88]:
second = df.loc[:,['Name','Address']]
second

     Name    Address
0     Jai      Delhi
1  Princi  Bangalore
2  Gaurav    Chennai
3    Anuj      Patna

### iloc: This function allows us to retrieve rows and columns by position. In order to do that, well need to specify the positions of the rows that we want, and the positions of the columns that we want as well. The df.iloc indexer is very similar to df.loc but only uses integer locations to make its selections.

In [89]:
third = df.iloc[3]  
third

Address          Patna
Height             5.2
Name              Anuj
Qualification      Msc
Name: 3, dtype: object

In [91]:
third = df.iloc [[2, 3]]
third

   Address  Height    Name Qualification
2  Chennai     5.1  Gaurav           Msc
3    Patna     5.2    Anuj           Msc

In [93]:
third = df.iloc[[2,3],[2,0]]
third

     Name  Address
2  Gaurav  Chennai
3    Anuj    Patna

In [94]:
third = df.iloc[:,[2,0]]
third

     Name    Address
0     Jai      Delhi
1  Princi  Bangalore
2  Gaurav    Chennai
3    Anuj      Patna

### ix: Early in the development of pandas, there existed another indexer, ix. This indexer was capable of selecting both by label and by integer location. While it was versatile, it caused lots of confusion because its not explicit. Sometimes integers can also be labels for rows or columns. Thus there were instances where it was ambiguous. Generally, ix is label based and acts just as the .loc indexer. However, .ix also supports integer type selections (as in .iloc) where passed an integer. This only works where the index of the DataFrame is not integer based .ix will accept any of the inputs of .loc and .iloc.
### Note: The .ix indexer has been deprecated in recent versions of Pandas.

In [96]:
forth = df.ix[0] 
forth

/anaconda/envs/py35/lib/python3.5/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

Address          Delhi
Height             5.1
Name               Jai
Qualification      Msc
Name: 0, dtype: object

# Boolean Indexing

In [98]:
df

     Address  Height    Name Qualification
0      Delhi     5.1     Jai           Msc
1  Bangalore     6.2  Princi            MA
2    Chennai     5.1  Gaurav           Msc
3      Patna     5.2    Anuj           Msc

In [99]:
df[[True,True,False,False]]

     Address  Height    Name Qualification
0      Delhi     5.1     Jai           Msc
1  Bangalore     6.2  Princi            MA

In [101]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
df = pd.DataFrame(dict, index = [True, False, True, False]) 
print(df.loc[True])

      degree    name  score
True     MBA  aparna     90
True  M.Tech  sudhir     80

In [103]:
# print(df.iloc[True])
# Won't work, In order to access a dataframe using .iloc[], we have to pass a boolean value (True or False) in a iloc[] function but iloc[] function accept only integer as argument so it will throw an error so we can only access a dataframe when we pass a integer in iloc[] function

In [104]:
df.iloc[1]

degree       BCA
name      pankaj
score         40
dtype: object

In [105]:
df.ix[True]

/anaconda/envs/py35/lib/python3.5/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

      degree    name  score
True     MBA  aparna     90
True  M.Tech  sudhir     80

In [106]:
df.ix[1]

/anaconda/envs/py35/lib/python3.5/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

degree       BCA
name      pankaj
score         40
dtype: object

In [107]:
df[df['degree'] == 'MBA']

      degree    name  score
True     MBA  aparna     90
False    MBA   Geeku     98

In [119]:
df.reset_index(inplace=True, drop=True)

In [120]:
df

   index  degree    name  score
0   True     MBA  aparna     90
1  False     BCA  pankaj     40
2   True  M.Tech  sudhir     80
3  False     MBA   Geeku     98

In [121]:
df[df.index >1]

   index  degree    name  score
2   True  M.Tech  sudhir     80
3  False     MBA   Geeku     98

# Filtering

In [260]:
df_excel = pd.read_excel("Excel_Sample.xlsx")

In [261]:
df_excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [262]:
df_excel[df_excel['a'] >0]

    a   b   c   d
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [263]:
df_excel[(df_excel['a'] > 0) & (df_excel['c'] >= 10)]

    a   b   c   d
2   8   9  10  11
3  12  13  14  15

In [264]:
df_excel[(df_excel.a > 0) & (df_excel.c >= 10)]

    a   b   c   d
2   8   9  10  11
3  12  13  14  15

In [265]:
df_excel[(df_excel['a'] > 0) & (df_excel['c'] >= 10)][['c','d']]

    c   d
2  10  11
3  14  15

# Groupby

In [266]:
df = pd.DataFrame([['A',10,3,5],['B',1,4,6],['A',9,4,1],['C',1,6,9],['C',4,2,1]], index=['Row1','Row2','Row3','Row4','Row5'], columns=['Col1','Col2','Col3','Col4'])

In [267]:
df

     Col1  Col2  Col3  Col4
Row1    A    10     3     5
Row2    B     1     4     6
Row3    A     9     4     1
Row4    C     1     6     9
Row5    C     4     2     1

In [268]:
df.groupby(['Col1']).agg(sum)

      Col2  Col3  Col4
Col1
A       19     7     6
B        1     4     6
C        5     8    10

In [269]:
df.groupby(['Col1']).mean()

      Col2  Col3  Col4
Col1
A      9.5   3.5   3.0
B      1.0   4.0   6.0
C      2.5   4.0   5.0

In [270]:
df.groupby(['Col1']).median()

      Col2  Col3  Col4
Col1
A      9.5   3.5   3.0
B      1.0   4.0   6.0
C      2.5   4.0   5.0

In [271]:
df.groupby(['Col1']).min()

      Col2  Col3  Col4
Col1
A        9     3     1
B        1     4     6
C        1     2     1

In [272]:
df.groupby(['Col1']).max()

      Col2  Col3  Col4
Col1
A       10     4     5
B        1     4     6
C        4     6     9

In [273]:
df.groupby(['Col1']).count() # returns DataFrame

      Col2  Col3  Col4
Col1
A        2     2     2
B        1     1     1
C        2     2     2

In [274]:
df.groupby(['Col1']).count()['Col2'] # returns Series

Col1
A    2
B    1
C    2
Name: Col2, dtype: int64

In [275]:
df.groupby(['Col1']).count()[['Col2']] # returns DataFrame

      Col2
Col1
A        2
B        1
C        2

# Series

In [198]:
ser = pd.Series() 
print(ser)

Series([], dtype: float64)

In [171]:
# Create series from array
data = np.array(['g','e','e','k','s'])
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [199]:
data = np.array(['g', 'e', 'e', 'k', 's']) 

# providing an index 
ser = pd.Series(data, index =[10, 11, 12, 13, 14]) 
print(ser)

10    g
11    e
12    e
13    k
14    s
dtype: object

In [172]:
# Create series from list
list = ['g', 'e', 'e', 'k', 's']
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [200]:
# Create series from dict
dict = {'Geeks' : 10, 
        'for' : 20, 
        'geeks' : 30}
ser = pd.Series(dict) 
print(ser)

Geeks    10
for      20
geeks    30
dtype: int64

In [201]:
# Create series from scalar value
ser = pd.Series(10, index =[0, 1, 2, 3, 4, 5]) 
  
print(ser)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [204]:
# Create series using numpy function
ser1 = pd.Series(np.linspace(3, 33, 3))  
print(ser1)  

ser2 = pd.Series(np.linspace(1, 100, 10))  
print("\n", ser2)

0     3.0
1    18.0
2    33.0
dtype: float64

 0      1.0
1     12.0
2     23.0
3     34.0
4     45.0
5     56.0
6     67.0
7     78.0
8     89.0
9    100.0
dtype: float64

### Creating dataframe using series

In [206]:
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])           # Define series 1 
s2 = pd.Series([1.1, 3.5, 4.7, 5.8, 2.9, 9.3]) # Define series 2 
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'])     # Define series 3 
  
Data ={'first':s1, 'second':s2, 'third':s3} # Define Data 
dfseries = pd.DataFrame(Data) 
dfseries

   first  second third
0      1     1.1     a
1      3     3.5     b
2      4     4.7     c
3      5     5.8     d
4      6     2.9     e
5      2     9.3   NaN
6      9     NaN   NaN

### Access elements of series
### There are two ways through which we can access element of series, they are :

##### Accessing Element from Series with Position
##### Accessing Element Using Label (index)

In [173]:
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)  
#retrieve the first element
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [174]:
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
# accessing a element using index element
print(ser[16])

o

### Indexing and Selecting Data in Series

In [177]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
df = pd.DataFrame(dict)
df

   degree    name  score
0     MBA  aparna     90
1     BCA  pankaj     40
2  M.Tech  sudhir     80
3     MBA   Geeku     98

In [180]:
ser = pd.Series(df['name']) 
data = ser.head(4)
data

0    aparna
1    pankaj
2    sudhir
3     Geeku
Name: name, dtype: object

In [181]:
# using indexing operator
data[1:3]

1    pankaj
2    sudhir
Name: name, dtype: object

In [183]:
# using .loc[] function
data.loc[1:3]

1    pankaj
2    sudhir
3     Geeku
Name: name, dtype: object

In [184]:
# using .iloc[] function
data.iloc[1:3]

1    pankaj
2    sudhir
Name: name, dtype: object

### Binary Operation on Series

In [187]:
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
print(data, "\n\n", data1)

# adding two series using
# .add
data.add(data1, fill_value=0)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [188]:
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e']) 
print(data, "\n\n", data1)

# subtracting two series using
# .sub
data.sub(data1, fill_value=0)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

### Conversion Operation on Series

In [194]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
data = pd.DataFrame(dict)
data

before = data.dtypes 

# converting dtypes using astype 
data["score"]= data["score"].astype(float) 
# storing dtype after converting 
after = data.dtypes
# printing to compare 
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 degree    object
name      object
score      int64
dtype: object

AFTER CONVERSION
 degree     object
name       object
score     float64
dtype: object

In [196]:
# storing dtype before operation 
dtype_before = type(data["degree"]) 

# converting to list 
salary_list = data["degree"].tolist() 
   
# storing dtype after operation 
dtype_after = type(salary_list) 
   
# printing dtype 
print("Data type before converting = {}\nData type after converting = {}"
      .format(dtype_before, dtype_after)) 
# displaying list 
salary_list

Data type before converting = <class 'pandas.core.series.Series'>
Data type after converting = <class 'list'>

['MBA', 'BCA', 'M.Tech', 'MBA']

# Concat

#### In order to concat dataframe, we use concat() function which helps in concatenating a dataframe. We can concat a dataframe in many different ways, they are:

###### Concatenating DataFrame using .concat()
###### Concatenating DataFrame by setting logic on axes
###### Concatenating DataFrame using .append()
###### Concatenating DataFrame by ignoring indexes
###### Concatenating DataFrame with group keys
###### Concatenating with mixed ndims

In [154]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1) 

# using a .concat() method
frames = [df, df1]
 
res1 = pd.concat(frames)
res1

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

      Address  Age    Name Qualification
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

In [156]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[2, 3, 6, 7]) 
 
print(df, "\n\n", df1) 

res2 = pd.concat([df, df1], axis=1, join='inner')
res2

     Address  Age  Mobile No    Name Qualification
0     Nagpur   27         97     Jai           Msc
1     Kanpur   24         91  Princi            MA
2  Allahabad   22         58  Gaurav           MCA
3    Kannuaj   32         76    Anuj           Phd

      Address  Age    Name Qualification  Salary
2  Allahabad   22  Gaurav           MCA    1000
3    Kannuaj   32    Anuj           Phd    2000
6  Allahabad   12  Dhiraj          Bcom    3000
7    Kannuaj   52  Hitesh        B.hons    4000

,Address,Age,Mobile No,Name,Qualification,Address,Age,Name,Qualification,Salary
2,Allahabad,22,58,Gaurav,MCA,Allahabad,22,Gaurav,MCA,1000
3,Kannuaj,32,76,Anuj,Phd,Kannuaj,32,Anuj,Phd,2000

In [157]:
res2 = pd.concat([df, df1], axis=1, sort=False)
res2

,Address,Age,Mobile No,Name,Qualification,Address,Age,Name,Qualification,Salary
0,Nagpur,27.0,97.0,Jai,Msc,NaN,NaN,NaN,NaN,NaN
1,Kanpur,24.0,91.0,Princi,MA,NaN,NaN,NaN,NaN,NaN
2,Allahabad,22.0,58.0,Gaurav,MCA,Allahabad,22.0,Gaurav,MCA,1000.0
3,Kannuaj,32.0,76.0,Anuj,Phd,Kannuaj,32.0,Anuj,Phd,2000.0
6,NaN,NaN,NaN,NaN,NaN,Allahabad,12.0,Dhiraj,Bcom,3000.0
7,NaN,NaN,NaN,NaN,NaN,Kannuaj,52.0,Hitesh,B.hons,4000.0

In [159]:
res3 = pd.concat([df, df1], axis=1, join_axes=[df.index])
res3

,Address,Age,Mobile No,Name,Qualification,Address,Age,Name,Qualification,Salary
0,Nagpur,27,97,Jai,Msc,NaN,NaN,NaN,NaN,NaN
1,Kanpur,24,91,Princi,MA,NaN,NaN,NaN,NaN,NaN
2,Allahabad,22,58,Gaurav,MCA,Allahabad,22.0,Gaurav,MCA,1000.0
3,Kannuaj,32,76,Anuj,Phd,Kannuaj,32.0,Anuj,Phd,2000.0

In [161]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1) 

# using append function 
res = df.append(df1)
res

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

      Address  Age    Name Qualification
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

In [162]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 
    
# Define a dictionary containing employee data 
data2 = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[2, 3, 6, 7]) 

print(df, "\n\n", df1)

# using ignore_index
res = pd.concat([df, df1], ignore_index=True)
res

     Address  Age  Mobile No    Name Qualification
0     Nagpur   27         97     Jai           Msc
1     Kanpur   24         91  Princi            MA
2  Allahabad   22         58  Gaurav           MCA
3    Kannuaj   32         76    Anuj           Phd

      Address  Age    Name Qualification  Salary
2  Allahabad   22  Gaurav           MCA    1000
3    Kannuaj   32    Anuj           Phd    2000
6  Allahabad   12  Dhiraj          Bcom    3000
7    Kannuaj   52  Hitesh        B.hons    4000

/anaconda/envs/py35/lib/python3.5/site-packages/ipykernel/__main__.py:23: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

     Address  Age  Mobile No    Name Qualification  Salary
0     Nagpur   27       97.0     Jai           Msc     NaN
1     Kanpur   24       91.0  Princi            MA     NaN
2  Allahabad   22       58.0  Gaurav           MCA     NaN
3    Kannuaj   32       76.0    Anuj           Phd     NaN
4  Allahabad   22        NaN  Gaurav           MCA  1000.0
5    Kannuaj   32        NaN    Anuj           Phd  2000.0
6  Allahabad   12        NaN  Dhiraj          Bcom  3000.0
7    Kannuaj   52        NaN  Hitesh        B.hons  4000.0

In [164]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)  

# using keys 
frames = [df, df1 ]
 
res = pd.concat(frames, keys=['x', 'y'])
res

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

      Address  Age    Name Qualification
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

       Address  Age    Name Qualification
x 0     Nagpur   27     Jai           Msc
  1     Kanpur   24  Princi            MA
  2  Allahabad   22  Gaurav           MCA
  3    Kannuaj   32    Anuj           Phd
y 4     Nagpur   17    Abhi         Btech
  5     Kanpur   14  Ayushi           B.A
  6  Allahabad   12  Dhiraj          Bcom
  7    Kannuaj   52  Hitesh        B.hons

In [165]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# creating a series
s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')
 
print(df, "\n\n", s1) 

# combining series and dataframe
res = pd.concat([df, s1], axis=1)
 
res

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

     Address  Age    Name Qualification  Salary
0     Nagpur   27     Jai           Msc    1000
1     Kanpur   24  Princi            MA    2000
2  Allahabad   22  Gaurav           MCA    3000
3    Kannuaj   32    Anuj           Phd    4000

# Merge/Join Dataframes

In [31]:
zoo_eats = pd.DataFrame([['elephant','vegetables'], ['tiger','meat'], ['kangaroo','vegetables'], ['zebra','vegetables'], ['giraffe','vegetables']], columns=['animal', 'food'])
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra  vegetables
4   giraffe  vegetables

In [32]:
zoo = pd.DataFrame([['elephant',1001,500], ['elephant',1002,600], ['elephant',1003,550], 
                    ['tiger',1004,300], ['tiger',1005,350], ['tiger',1006,400], ['tiger',1007,450],
                    ['kangaroo',1008, 200], ['kangaroo',1009,250], 
                    ['zebra',1010,300], ['zebra',1011,350],
                    ['giraffe',1012,550], ['giraffe',1013,600], ['giraffe',1014,700], ['giraffe',1015,810], ['giraffe',1016,870],
                   ], columns=['animal', 'uniq_id', 'water_need'])
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         350
5      tiger     1006         400
6      tiger     1007         450
7   kangaroo     1008         200
8   kangaroo     1009         250
9      zebra     1010         300
10     zebra     1011         350
11   giraffe     1012         550
12   giraffe     1013         600
13   giraffe     1014         700
14   giraffe     1015         810
15   giraffe     1016         870

In [33]:
zoo.merge(zoo_eats)

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         350        meat
5      tiger     1006         400        meat
6      tiger     1007         450        meat
7   kangaroo     1008         200  vegetables
8   kangaroo     1009         250  vegetables
9      zebra     1010         300  vegetables
10     zebra     1011         350  vegetables
11   giraffe     1012         550  vegetables
12   giraffe     1013         600  vegetables
13   giraffe     1014         700  vegetables
14   giraffe     1015         810  vegetables
15   giraffe     1016         870  vegetables

In [34]:
zoo.merge(zoo_eats, how="outer")

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         350        meat
5      tiger     1006         400        meat
6      tiger     1007         450        meat
7   kangaroo     1008         200  vegetables
8   kangaroo     1009         250  vegetables
9      zebra     1010         300  vegetables
10     zebra     1011         350  vegetables
11   giraffe     1012         550  vegetables
12   giraffe     1013         600  vegetables
13   giraffe     1014         700  vegetables
14   giraffe     1015         810  vegetables
15   giraffe     1016         870  vegetables

In [35]:
zoo.merge(zoo_eats, how="left")

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         350        meat
5      tiger     1006         400        meat
6      tiger     1007         450        meat
7   kangaroo     1008         200  vegetables
8   kangaroo     1009         250  vegetables
9      zebra     1010         300  vegetables
10     zebra     1011         350  vegetables
11   giraffe     1012         550  vegetables
12   giraffe     1013         600  vegetables
13   giraffe     1014         700  vegetables
14   giraffe     1015         810  vegetables
15   giraffe     1016         870  vegetables

In [36]:
A = pd.DataFrame({'x':np.arange(5)})
B = pd.DataFrame({'x':np.arange(3,8)})
print(A)
print(B)

   x
0  0
1  1
2  2
3  3
4  4
   x
0  3
1  4
2  5
3  6
4  7

In [37]:
pd.merge(A,B, how='outer', indicator=True)

   x      _merge
0  0   left_only
1  1   left_only
2  2   left_only
3  3        both
4  4        both
5  5  right_only
6  6  right_only
7  7  right_only

In [166]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
df = pd.DataFrame(data1)
df1 = pd.DataFrame(data2) 
print(df, "\n\n", df1) 

# merging dataframe using multiple keys
res1 = pd.merge(df, df1, on=['key', 'key1'])
res1

   Age    Name key key1
0   27     Jai  K0   K0
1   24  Princi  K1   K1
2   22  Gaurav  K2   K0
3   32    Anuj  K3   K1

      Address Qualification key key1
0     Nagpur         Btech  K0   K0
1     Kanpur           B.A  K1   K0
2  Allahabad          Bcom  K2   K0
3    Kannuaj        B.hons  K3   K0

   Age    Name key key1    Address Qualification
0   27     Jai  K0   K0     Nagpur         Btech
1   22  Gaurav  K2   K0  Allahabad          Bcom

### Left Anti and Right Ani Joins

In [38]:
merged = pd.merge(A,B, how='outer', indicator=True)
print("Left Anti")
merged[merged['_merge'] =='left_only']

Left Anti

   x     _merge
0  0  left_only
1  1  left_only
2  2  left_only

In [39]:
print("Right Anti")
merged[merged['_merge'] =='right_only']

Right Anti

   x      _merge
5  5  right_only
6  6  right_only
7  7  right_only

In [40]:
# Also like this
A[~A['x'].isin(B['x'])] # left Anti

   x
0  0
1  1
2  2

In [41]:
# Also like this
B[~B['x'].isin(A['x'])] # RIght Anti

   x
2  5
3  6
4  7

# Join

In [167]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])
df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])
print(df, "\n\n", df1)  
res = df.join(df1) 
res

    Age    Name
K0   27     Jai
K1   24  Princi
K2   22  Gaurav
K3   32    Anuj

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

    Age    Name    Address Qualification
K0   27     Jai  Allahabad           MCA
K1   24  Princi        NaN           NaN
K2   22  Gaurav    Kannuaj           Phd
K3   32    Anuj  Allahabad          Bcom

In [168]:
res1 = df.join(df1, how='outer')
res1

     Age    Name    Address Qualification
K0  27.0     Jai  Allahabad           MCA
K1  24.0  Princi        NaN           NaN
K2  22.0  Gaurav    Kannuaj           Phd
K3  32.0    Anuj  Allahabad          Bcom
K4   NaN     NaN    Kannuaj        B.hons

In [169]:
res1 = df.join(df1, how='inner')
res1

    Age    Name    Address Qualification
K0   27     Jai  Allahabad           MCA
K2   22  Gaurav    Kannuaj           Phd
K3   32    Anuj  Allahabad          Bcom

# Join multi-indexed dataframes

In [170]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav'], 
        'Age':[27, 24, 22]} 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kanpur'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
df = pd.DataFrame(data1, index=pd.Index(['K0', 'K1', 'K2'], name='key')) 
index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                   ('K2', 'Y2'), ('K2', 'Y3')],
                                   names=['key', 'Y'])
df1 = pd.DataFrame(data2, index= index)
print(df, "\n\n", df1)
# joining singly indexed with multi indexed
result = df.join(df1, how='inner')
result

     Age    Name
key
K0    27     Jai
K1    24  Princi
K2    22  Gaurav

           Address Qualification
key Y
K0  Y0  Allahabad           MCA
K1  Y1    Kannuaj           Phd
K2  Y2  Allahabad          Bcom
    Y3     Kanpur        B.hons

        Age    Name    Address Qualification
key Y
K0  Y0   27     Jai  Allahabad           MCA
K1  Y1   24  Princi    Kannuaj           Phd
K2  Y2   22  Gaurav  Allahabad          Bcom
    Y3   22  Gaurav     Kanpur        B.hons

# Sorting

In [42]:
zoo.sort_values('water_need')

      animal  uniq_id  water_need
7   kangaroo     1008         200
8   kangaroo     1009         250
3      tiger     1004         300
9      zebra     1010         300
4      tiger     1005         350
10     zebra     1011         350
5      tiger     1006         400
6      tiger     1007         450
0   elephant     1001         500
2   elephant     1003         550
11   giraffe     1012         550
1   elephant     1002         600
12   giraffe     1013         600
13   giraffe     1014         700
14   giraffe     1015         810
15   giraffe     1016         870

In [43]:
zoo.sort_values(by=['animal','water_need'])

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
11   giraffe     1012         550
12   giraffe     1013         600
13   giraffe     1014         700
14   giraffe     1015         810
15   giraffe     1016         870
7   kangaroo     1008         200
8   kangaroo     1009         250
3      tiger     1004         300
4      tiger     1005         350
5      tiger     1006         400
6      tiger     1007         450
9      zebra     1010         300
10     zebra     1011         350

In [44]:
zoo.sort_values(by=['animal','water_need'], ascending=False)

      animal  uniq_id  water_need
10     zebra     1011         350
9      zebra     1010         300
6      tiger     1007         450
5      tiger     1006         400
4      tiger     1005         350
3      tiger     1004         300
8   kangaroo     1009         250
7   kangaroo     1008         200
15   giraffe     1016         870
14   giraffe     1015         810
13   giraffe     1014         700
12   giraffe     1013         600
11   giraffe     1012         550
1   elephant     1002         600
2   elephant     1003         550
0   elephant     1001         500

# Reset Index

In [45]:
zoo.sort_values(by=['animal','water_need'], ascending=False).reset_index()

    index    animal  uniq_id  water_need
0      10     zebra     1011         350
1       9     zebra     1010         300
2       6     tiger     1007         450
3       5     tiger     1006         400
4       4     tiger     1005         350
5       3     tiger     1004         300
6       8  kangaroo     1009         250
7       7  kangaroo     1008         200
8      15   giraffe     1016         870
9      14   giraffe     1015         810
10     13   giraffe     1014         700
11     12   giraffe     1013         600
12     11   giraffe     1012         550
13      1  elephant     1002         600
14      2  elephant     1003         550
15      0  elephant     1001         500

In [46]:
zoo.sort_values(by=['animal','water_need'], ascending=False).reset_index(drop=True) # drop previous indexes

      animal  uniq_id  water_need
0      zebra     1011         350
1      zebra     1010         300
2      tiger     1007         450
3      tiger     1006         400
4      tiger     1005         350
5      tiger     1004         300
6   kangaroo     1009         250
7   kangaroo     1008         200
8    giraffe     1016         870
9    giraffe     1015         810
10   giraffe     1014         700
11   giraffe     1013         600
12   giraffe     1012         550
13  elephant     1002         600
14  elephant     1003         550
15  elephant     1001         500

In [47]:
zoo.drop(['uniq_id'], axis =1)

      animal  water_need
0   elephant         500
1   elephant         600
2   elephant         550
3      tiger         300
4      tiger         350
5      tiger         400
6      tiger         450
7   kangaroo         200
8   kangaroo         250
9      zebra         300
10     zebra         350
11   giraffe         550
12   giraffe         600
13   giraffe         700
14   giraffe         810
15   giraffe         870

In [48]:
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         350
5      tiger     1006         400
6      tiger     1007         450
7   kangaroo     1008         200
8   kangaroo     1009         250
9      zebra     1010         300
10     zebra     1011         350
11   giraffe     1012         550
12   giraffe     1013         600
13   giraffe     1014         700
14   giraffe     1015         810
15   giraffe     1016         870

In [49]:
zoo.drop(['uniq_id'], axis =1, inplace=True)

In [50]:
zoo

      animal  water_need
0   elephant         500
1   elephant         600
2   elephant         550
3      tiger         300
4      tiger         350
5      tiger         400
6      tiger         450
7   kangaroo         200
8   kangaroo         250
9      zebra         300
10     zebra         350
11   giraffe         550
12   giraffe         600
13   giraffe         700
14   giraffe         810
15   giraffe         870

In [51]:
zoo.drop(7, axis=0, inplace=True)

In [52]:
zoo

      animal  water_need
0   elephant         500
1   elephant         600
2   elephant         550
3      tiger         300
4      tiger         350
5      tiger         400
6      tiger         450
8   kangaroo         250
9      zebra         300
10     zebra         350
11   giraffe         550
12   giraffe         600
13   giraffe         700
14   giraffe         810
15   giraffe         870

In [97]:
zoo[[True,False,True,False,True,False,True,False,True,False,True,False,True,False,True]]

      animal  water_need    type
0   elephant         500  animal
2   elephant         550  animal
4      tiger         350  animal
6      tiger         450  animal
9      zebra         300  animal
11   giraffe         550  animal
13   giraffe         700  animal
15   giraffe         870  animal

# Functions

### Query

In [54]:
zoo.query('animal == "elephant"')

     animal  water_need
0  elephant         500
1  elephant         600
2  elephant         550

### Where

In [55]:
zoo.where((zoo["animal"] == 'giraffe') & (zoo["water_need"] >=600))

     animal  water_need
0       NaN         NaN
1       NaN         NaN
2       NaN         NaN
3       NaN         NaN
4       NaN         NaN
5       NaN         NaN
6       NaN         NaN
8       NaN         NaN
9       NaN         NaN
10      NaN         NaN
11      NaN         NaN
12  giraffe       600.0
13  giraffe       700.0
14  giraffe       810.0
15  giraffe       870.0

### Insert

In [59]:
zoo.insert(2, "type", "animal")
zoo

      animal  water_need    type
0   elephant         500  animal
1   elephant         600  animal
2   elephant         550  animal
3      tiger         300  animal
4      tiger         350  animal
5      tiger         400  animal
6      tiger         450  animal
8   kangaroo         250  animal
9      zebra         300  animal
10     zebra         350  animal
11   giraffe         550  animal
12   giraffe         600  animal
13   giraffe         700  animal
14   giraffe         810  animal
15   giraffe         870  animal

# Change Datatype

In [60]:
type(zoo["water_need"][0])

numpy.int64

In [61]:
type(zoo.water_need[0])

numpy.int64

In [62]:
type(zoo.water_need.astype('float64')[0])

numpy.float64

# Iterate through Dataframe rows and columns

In [63]:
for i, j in zoo.iteritems():
    print(j) # Returns Series Object

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
8     kangaroo
9        zebra
10       zebra
11     giraffe
12     giraffe
13     giraffe
14     giraffe
15     giraffe
Name: animal, dtype: object
0     500
1     600
2     550
3     300
4     350
5     400
6     450
8     250
9     300
10    350
11    550
12    600
13    700
14    810
15    870
Name: water_need, dtype: int64
0     animal
1     animal
2     animal
3     animal
4     animal
5     animal
6     animal
8     animal
9     animal
10    animal
11    animal
12    animal
13    animal
14    animal
15    animal
Name: type, dtype: object

In [64]:
for i in zoo.itertuples():
    print(i)

Pandas(Index=0, animal='elephant', water_need=500, type='animal')
Pandas(Index=1, animal='elephant', water_need=600, type='animal')
Pandas(Index=2, animal='elephant', water_need=550, type='animal')
Pandas(Index=3, animal='tiger', water_need=300, type='animal')
Pandas(Index=4, animal='tiger', water_need=350, type='animal')
Pandas(Index=5, animal='tiger', water_need=400, type='animal')
Pandas(Index=6, animal='tiger', water_need=450, type='animal')
Pandas(Index=8, animal='kangaroo', water_need=250, type='animal')
Pandas(Index=9, animal='zebra', water_need=300, type='animal')
Pandas(Index=10, animal='zebra', water_need=350, type='animal')
Pandas(Index=11, animal='giraffe', water_need=550, type='animal')
Pandas(Index=12, animal='giraffe', water_need=600, type='animal')
Pandas(Index=13, animal='giraffe', water_need=700, type='animal')
Pandas(Index=14, animal='giraffe', water_need=810, type='animal')
Pandas(Index=15, animal='giraffe', water_need=870, type='animal')

In [65]:
for i in zoo.columns:
    print(i)

animal
water_need
type

In [66]:
for i in list(zoo):
    print(zoo[i])

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
8     kangaroo
9        zebra
10       zebra
11     giraffe
12     giraffe
13     giraffe
14     giraffe
15     giraffe
Name: animal, dtype: object
0     500
1     600
2     550
3     300
4     350
5     400
6     450
8     250
9     300
10    350
11    550
12    600
13    700
14    810
15    870
Name: water_need, dtype: int64
0     animal
1     animal
2     animal
3     animal
4     animal
5     animal
6     animal
8     animal
9     animal
10    animal
11    animal
12    animal
13    animal
14    animal
15    animal
Name: type, dtype: object

In [67]:
for i in list(zoo):
    print(zoo[i][2])

elephant
550
animal

# Working with text data

In [136]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
df = pd.DataFrame(data) 
df["Name"]= df["Name"].str.lower() 
df

     Address  Age    Name Qualification
0      Delhi   27     jai           Msc
1     Kanpur   24  princi            MA
2  Allahabad   22  gaurav           MCA
3    Kannauj   32    anuj           Phd

In [137]:
df["Name"]= df["Name"].str.upper() 
df

     Address  Age    Name Qualification
0      Delhi   27     JAI           Msc
1     Kanpur   24  PRINCI            MA
2  Allahabad   22  GAURAV           MCA
3    Kannauj   32    ANUJ           Phd

### Split and replace data

In [140]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Knnuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
df = pd.DataFrame(data) 
df

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3     Knnuaj   32    Anuj           Phd

In [141]:
df.dropna(inplace = True) 
df["Address"]= df["Address"].str.split("a", n = 1, expand = True) 
df

  Address  Age    Name Qualification
0       N   27     Jai           Msc
1       K   24  Princi            MA
2     All   22  Gaurav           MCA
3    Knnu   32    Anuj           Phd

### Concat Data

In [142]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
df = pd.DataFrame(data) 
df

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

In [143]:
# making copy of address column 
new = df["Address"].copy()   
# concatenating address with name column 
# overwriting name column 
df["Name"]= df["Name"].str.cat(new, sep =", ") 
df

     Address  Age               Name Qualification
0     Nagpur   27        Jai, Nagpur           Msc
1     Kanpur   24     Princi, Kanpur            MA
2  Allahabad   22  Gaurav, Allahabad           MCA
3    Kannuaj   32      Anuj, Kannuaj           Phd

# Remove Whitespaces

In [144]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur junction', 'Kanpur junction', 
                   'Nagpur junction', 'Kannuaj junction'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
df = pd.DataFrame(data)
df

            Address  Age    Name Qualification
0   Nagpur junction   27     Jai           Msc
1   Kanpur junction   24  Princi            MA
2   Nagpur junction   22  Gaurav           MCA
3  Kannuaj junction   32    Anuj           Phd

In [145]:
# replacing address name and adding spaces in start and end 
new = df["Address"].replace("Nagpur junction", "  Nagpur junction  ").copy() 
# checking with custom string 
print(new.str.strip()==" Nagpur junction")
print(new.str.strip()=="Nagpur junction ")
print(new.str.strip()==" Nagpur junction ")

0    False
1    False
2    False
3    False
Name: Address, dtype: bool
0    False
1    False
2    False
3    False
Name: Address, dtype: bool
0    False
1    False
2    False
3    False
Name: Address, dtype: bool

# Extract Data

In [147]:
s = pd.Series(['a1', 'b2', 'c3'])
# Extracting a data
n= s.str.extract(r'([ab])(\d)')
 
n

     0    1
0    a    1
1    b    2
2  NaN  NaN

In [148]:
s = pd.Series(['a1', 'b2', 'c3'])
 
# Extracting a data
n = s.str.extract(r'(?P<Geeks>[ab])(?P<For>\d)')
n

  Geeks  For
0     a    1
1     b    2
2   NaN  NaN

# Date and Time

In [150]:
data = pd.date_range('1/1/2011', periods = 10, freq ='H')
data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00',
               '2011-01-01 06:00:00', '2011-01-01 07:00:00',
               '2011-01-01 08:00:00', '2011-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [152]:
from datetime import datetime
x = datetime.now()
x.month, x.year

(2, 2020)

In [153]:
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2011', periods = 72, freq ='H')
 
# Print the dates in dd-mm-yy format
rng[:5]
 
# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute
 
# Print the dates divided into features
rng.head(3)

                 date  year  month  day  hour  minute
0 2011-01-01 00:00:00  2011      1    1     0       0
1 2011-01-01 01:00:00  2011      1    1     1       0
2 2011-01-01 02:00:00  2011      1    1     2       0

# CSV

In [213]:
from io import StringIO, BytesIO

In [214]:
data=('col1,col2,col3\n'
     'x,y.,1\n'
     'a,b,2\n'
     'c,d,3\n')

In [215]:
type(data)

str

In [216]:
StringIO()

In [217]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x   y.     1
1    a    b     2
2    c    d     3

In [218]:
df = pd.read_csv(StringIO(data), usecols=['col1','col3'])

In [219]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [220]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11\n')

In [221]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [222]:
df=pd.read_csv(StringIO(data), dtype=object)

In [223]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [224]:
df['a'][1]

'5'

In [225]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11,12\n')

In [226]:
df=pd.read_csv(StringIO(data), dtype=float)

In [227]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [228]:
df['a']

0    1.0
1    5.0
2    9.0
Name: a, dtype: float64

In [229]:
df=pd.read_csv(StringIO(data), dtype={'a': object, 'b':float, 'c':int})

In [230]:
df

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [231]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [232]:
df['b']

0     2.0
1     6.0
2    10.0
Name: b, dtype: float64

In [233]:
df['c']

0     3
1     7
2    11
Name: c, dtype: int64

In [234]:
df.dtypes

a     object
b    float64
c      int64
d      int64
dtype: object

In [235]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cat,10\n')

In [236]:
pd.read_csv(StringIO(data), index_col = 0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cat  10.0

In [237]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cat,\n')

In [238]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cat NaN

In [239]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cat,\n')

In [240]:
pd.read_csv(StringIO(data), index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cat

In [241]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cat,\n')

In [242]:
pd.read_csv(StringIO(data), usecols=['b','c'], index_col=False)

        b    c
0   apple  bat
1  orange  cat

In [243]:
data='a,b\n"hello , \\"Bob\\", nice to see you",5'

In [244]:
pd.read_csv(StringIO(data), escapechar="\\")

                                a  b
0  hello , "Bob", nice to see you  5

In [245]:
# df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', 
#                  sep='\t')
# df.head()

# Read JSON to CSV

In [246]:
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1": "Team Lead", "title2": "Sr. Developer"}]}'

In [247]:
df1 = pd.read_json(Data) # header=None

In [248]:
df1

,email,employee_name,job_profile
0,james@gmail.com,James,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [249]:
df = pd.read_csv('wine.csv', header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,NaN,0,1.00,2.00,3.00,4.0,5,6.00,7.00,8.00,9.00,10.00,11.00,12.00,13
1,0.0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
2,1.0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
3,2.0,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
4,3.0,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480

In [250]:
df1.to_json()

'{"email":{"0":"james@gmail.com"},"employee_name":{"0":"James"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [251]:
df1.to_json(orient="records")

'[{"email":"james@gmail.com","employee_name":"James","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [252]:
df.to_json(orient="records")

'[{"0":null,"1":0,"2":1.0,"3":2.0,"4":3.0,"5":4.0,"6":5,"7":6.0,"8":7.0,"9":8.0,"10":9.0,"11":10.0,"12":11.0,"13":12.0,"14":13},{"0":0.0,"1":1,"2":14.23,"3":1.71,"4":2.43,"5":15.6,"6":127,"7":2.8,"8":3.06,"9":0.28,"10":2.29,"11":5.64,"12":1.04,"13":3.92,"14":1065},{"0":1.0,"1":1,"2":13.2,"3":1.78,"4":2.14,"5":11.2,"6":100,"7":2.65,"8":2.76,"9":0.26,"10":1.28,"11":4.38,"12":1.05,"13":3.4,"14":1050},{"0":2.0,"1":1,"2":13.16,"3":2.36,"4":2.67,"5":18.6,"6":101,"7":2.8,"8":3.24,"9":0.3,"10":2.81,"11":5.68,"12":1.03,"13":3.17,"14":1185},{"0":3.0,"1":1,"2":14.37,"3":1.95,"4":2.5,"5":16.8,"6":113,"7":3.85,"8":3.49,"9":0.24,"10":2.18,"11":7.8,"12":0.86,"13":3.45,"14":1480},{"0":4.0,"1":1,"2":13.24,"3":2.59,"4":2.87,"5":21.0,"6":118,"7":2.8,"8":2.69,"9":0.39,"10":1.82,"11":4.32,"12":1.04,"13":2.93,"14":735},{"0":5.0,"1":1,"2":14.2,"3":1.76,"4":2.45,"5":15.2,"6":112,"7":3.27,"8":3.39,"9":0.34,"10":1.97,"11":6.75,"12":1.05,"13":2.85,"14":1450},{"0":6.0,"1":1,"2":14.39,"3":1.87,"4":2.45,"5":14.6,"6":96,"7":2.5,"8":2.52,"9":0.3,"10":1.98,"11":5.25,"12":1.02,"13":3.58,"14":1290},{"0":7.0,"1":1,"2":14.06,"3":2.15,"4":2.61,"5":17.6,"6":121,"7":2.6,"8":2.51,"9":0.31,"10":1.25,"11":5.05,"12":1.06,"13":3.58,"14":1295},{"0":8.0,"1":1,"2":14.83,"3":1.64,"4":2.17,"5":14.0,"6":97,"7":2.8,"8":2.98,"9":0.29,"10":1.98,"11":5.2,"12":1.08,"13":2.85,"14":1045},{"0":9.0,"1":1,"2":13.86,"3":1.35,"4":2.27,"5":16.0,"6":98,"7":2.98,"8":3.15,"9":0.22,"10":1.85,"11":7.22,"12":1.01,"13":3.55,"14":1045},{"0":10.0,"1":1,"2":14.1,"3":2.16,"4":2.3,"5":18.0,"6":105,"7":2.95,"8":3.32,"9":0.22,"10":2.38,"11":5.75,"12":1.25,"13":3.17,"14":1510},{"0":11.0,"1":1,"2":14.12,"3":1.48,"4":2.32,"5":16.8,"6":95,"7":2.2,"8":2.43,"9":0.26,"10":1.57,"11":5.0,"12":1.17,"13":2.82,"14":1280},{"0":12.0,"1":1,"2":13.75,"3":1.73,"4":2.41,"5":16.0,"6":89,"7":2.6,"8":2.76,"9":0.29,"10":1.81,"11":5.6,"12":1.15,"13":2.9,"14":1320},{"0":13.0,"1":1,"2":14.75,"3":1.73,"4":2.39,"5":11.4,"6":91,"7":3.1,"8":3.69,"9":0.43,"10":2.81,"11":5.4,"12":1.25,"13":2.73,"14":1150},{"0":14.0,"1":1,"2":14.38,"3":1.87,"4":2.38,"5":12.0,"6":102,"7":3.3,"8":3.64,"9":0.29,"10":2.96,"11":7.5,"12":1.2,"13":3.0,"14":1547},{"0":15.0,"1":1,"2":13.63,"3":1.81,"4":2.7,"5":17.2,"6":112,"7":2.85,"8":2.91,"9":0.3,"10":1.46,"11":7.3,"12":1.28,"13":2.88,"14":1310},{"0":16.0,"1":1,"2":14.3,"3":1.92,"4":2.72,"5":20.0,"6":120,"7":2.8,"8":3.14,"9":0.33,"10":1.97,"11":6.2,"12":1.07,"13":2.65,"14":1280},{"0":17.0,"1":1,"2":13.83,"3":1.57,"4":2.62,"5":20.0,"6":115,"7":2.95,"8":3.4,"9":0.4,"10":1.72,"11":6.6,"12":1.13,"13":2.57,"14":1130},{"0":18.0,"1":1,"2":14.19,"3":1.59,"4":2.48,"5":16.5,"6":108,"7":3.3,"8":3.93,"9":0.32,"10":1.86,"11":8.7,"12":1.23,"13":2.82,"14":1680},{"0":19.0,"1":1,"2":13.64,"3":3.1,"4":2.56,"5":15.2,"6":116,"7":2.7,"8":3.03,"9":0.17,"10":1.66,"11":5.1,"12":0.96,"13":3.36,"14":845},{"0":20.0,"1":1,"2":14.06,"3":1.63,"4":2.28,"5":16.0,"6":126,"7":3.0,"8":3.17,"9":0.24,"10":2.1,"11":5.65,"12":1.09,"13":3.71,"14":780},{"0":21.0,"1":1,"2":12.93,"3":3.8,"4":2.65,"5":18.6,"6":102,"7":2.41,"8":2.41,"9":0.25,"10":1.98,"11":4.5,"12":1.03,"13":3.52,"14":770},{"0":22.0,"1":1,"2":13.71,"3":1.86,"4":2.36,"5":16.6,"6":101,"7":2.61,"8":2.88,"9":0.27,"10":1.69,"11":3.8,"12":1.11,"13":4.0,"14":1035},{"0":23.0,"1":1,"2":12.85,"3":1.6,"4":2.52,"5":17.8,"6":95,"7":2.48,"8":2.37,"9":0.26,"10":1.46,"11":3.93,"12":1.09,"13":3.63,"14":1015},{"0":24.0,"1":1,"2":13.5,"3":1.81,"4":2.61,"5":20.0,"6":96,"7":2.53,"8":2.61,"9":0.28,"10":1.66,"11":3.52,"12":1.12,"13":3.82,"14":845},{"0":25.0,"1":1,"2":13.05,"3":2.05,"4":3.22,"5":25.0,"6":124,"7":2.63,"8":2.68,"9":0.47,"10":1.92,"11":3.58,"12":1.13,"13":3.2,"14":830},{"0":26.0,"1":1,"2":13.39,"3":1.77,"4":2.62,"5":16.1,"6":93,"7":2.85,"8":2.94,"9":0.34,"10":1.45,"11":4.8,"12":0.92,"13":3.22,"14":1195},{"0":27.0,"1":1,"2":13.3,"3":1.72,"4":2.14,"5":17.0,"6":94,"7":2.4,"8":2.19,"9":0.27,"10":1.35,"11":3.95,"12":1.02,"13":2.77,"14":1285},{"0":28.0,"1":1,"2":13.87,"3":1.9,"4":2.8,"5":19.4,"6":107,"7":2.95,"8":2.97,"9":0.37,"10":1.76,"11":4.5,"12":1.25,"13":3.4,"14":915},{"0":29.0,"1":1,"2":14.02,"3":1.68,"4":2.21,"5":16.0,"6":96,"7":2.65,"8":2.33,"9":0.26,"10":1.98,"11":4.7,"12":1.04,"13":3.59,"14":1035},{"0":30.0,"1":1,"2":13.73,"3":1.5,"4":2.7,"5":22.5,"6":101,"7":3.0,"8":3.25,"9":0.29,"10":2.38,"11":5.7,"12":1.19,"13":2.71,"14":1285},{"0":31.0,"1":1,"2":13.58,"3":1.66,"4":2.36,"5":19.1,"6":106,"7":2.86,"8":3.19,"9":0.22,"10":1.95,"11":6.9,"12":1.09,"13":2.88,"14":1515},{"0":32.0,"1":1,"2":13.68,"3":1.83,"4":2.36,"5":17.2,"6":104,"7":2.42,"8":2.69,"9":0.42,"10":1.97,"11":3.84,"12":1.23,"13":2.87,"14":990},{"0":33.0,"1":1,"2":13.76,"3":1.53,"4":2.7,"5":19.5,"6":132,"7":2.95,"8":2.74,"9":0.5,"10":1.35,"11":5.4,"12":1.25,"13":3.0,"14":1235},{"0":34.0,"1":1,"2":13.51,"3":1.8,"4":2.65,"5":19.0,"6":110,"7":2.35,"8":2.53,"9":0.29,"10":1.54,"11":4.2,"12":1.1,"13":2.87,"14":1095},{"0":35.0,"1":1,"2":13.48,"3":1.81,"4":2.41,"5":20.5,"6":100,"7":2.7,"8":2.98,"9":0.26,"10":1.86,"11":5.1,"12":1.04,"13":3.47,"14":920},{"0":36.0,"1":1,"2":13.28,"3":1.64,"4":2.84,"5":15.5,"6":110,"7":2.6,"8":2.68,"9":0.34,"10":1.36,"11":4.6,"12":1.09,"13":2.78,"14":880},{"0":37.0,"1":1,"2":13.05,"3":1.65,"4":2.55,"5":18.0,"6":98,"7":2.45,"8":2.43,"9":0.29,"10":1.44,"11":4.25,"12":1.12,"13":2.51,"14":1105},{"0":38.0,"1":1,"2":13.07,"3":1.5,"4":2.1,"5":15.5,"6":98,"7":2.4,"8":2.64,"9":0.28,"10":1.37,"11":3.7,"12":1.18,"13":2.69,"14":1020},{"0":39.0,"1":1,"2":14.22,"3":3.99,"4":2.51,"5":13.2,"6":128,"7":3.0,"8":3.04,"9":0.2,"10":2.08,"11":5.1,"12":0.89,"13":3.53,"14":760},{"0":40.0,"1":1,"2":13.56,"3":1.71,"4":2.31,"5":16.2,"6":117,"7":3.15,"8":3.29,"9":0.34,"10":2.34,"11":6.13,"12":0.95,"13":3.38,"14":795},{"0":41.0,"1":1,"2":13.41,"3":3.84,"4":2.12,"5":18.8,"6":90,"7":2.45,"8":2.68,"9":0.27,"10":1.48,"11":4.28,"12":0.91,"13":3.0,"14":1035},{"0":42.0,"1":1,"2":13.88,"3":1.89,"4":2.59,"5":15.0,"6":101,"7":3.25,"8":3.56,"9":0.17,"10":1.7,"11":5.43,"12":0.88,"13":3.56,"14":1095},{"0":43.0,"1":1,"2":13.24,"3":3.98,"4":2.29,"5":17.5,"6":103,"7":2.64,"8":2.63,"9":0.32,"10":1.66,"11":4.36,"12":0.82,"13":3.0,"14":680},{"0":44.0,"1":1,"2":13.05,"3":1.77,"4":2.1,"5":17.0,"6":107,"7":3.0,"8":3.0,"9":0.28,"10":2.03,"11":5.04,"12":0.88,"13":3.35,"14":885},{"0":45.0,"1":1,"2":14.21,"3":4.04,"4":2.44,"5":18.9,"6":111,"7":2.85,"8":2.65,"9":0.3,"10":1.25,"11":5.24,"12":0.87,"13":3.33,"14":1080},{"0":46.0,"1":1,"2":14.38,"3":3.59,"4":2.28,"5":16.0,"6":102,"7":3.25,"8":3.17,"9":0.27,"10":2.19,"11":4.9,"12":1.04,"13":3.44,"14":1065},{"0":47.0,"1":1,"2":13.9,"3":1.68,"4":2.12,"5":16.0,"6":101,"7":3.1,"8":3.39,"9":0.21,"10":2.14,"11":6.1,"12":0.91,"13":3.33,"14":985},{"0":48.0,"1":1,"2":14.1,"3":2.02,"4":2.4,"5":18.8,"6":103,"7":2.75,"8":2.92,"9":0.32,"10":2.38,"11":6.2,"12":1.07,"13":2.75,"14":1060},{"0":49.0,"1":1,"2":13.94,"3":1.73,"4":2.27,"5":17.4,"6":108,"7":2.88,"8":3.54,"9":0.32,"10":2.08,"11":8.9,"12":1.12,"13":3.1,"14":1260},{"0":50.0,"1":1,"2":13.05,"3":1.73,"4":2.04,"5":12.4,"6":92,"7":2.72,"8":3.27,"9":0.17,"10":2.91,"11":7.2,"12":1.12,"13":2.91,"14":1150},{"0":51.0,"1":1,"2":13.83,"3":1.65,"4":2.6,"5":17.2,"6":94,"7":2.45,"8":2.99,"9":0.22,"10":2.29,"11":5.6,"12":1.24,"13":3.37,"14":1265},{"0":52.0,"1":1,"2":13.82,"3":1.75,"4":2.42,"5":14.0,"6":111,"7":3.88,"8":3.74,"9":0.32,"10":1.87,"11":7.05,"12":1.01,"13":3.26,"14":1190},{"0":53.0,"1":1,"2":13.77,"3":1.9,"4":2.68,"5":17.1,"6":115,"7":3.0,"8":2.79,"9":0.39,"10":1.68,"11":6.3,"12":1.13,"13":2.93,"14":1375},{"0":54.0,"1":1,"2":13.74,"3":1.67,"4":2.25,"5":16.4,"6":118,"7":2.6,"8":2.9,"9":0.21,"10":1.62,"11":5.85,"12":0.92,"13":3.2,"14":1060},{"0":55.0,"1":1,"2":13.56,"3":1.73,"4":2.46,"5":20.5,"6":116,"7":2.96,"8":2.78,"9":0.2,"10":2.45,"11":6.25,"12":0.98,"13":3.03,"14":1120},{"0":56.0,"1":1,"2":14.22,"3":1.7,"4":2.3,"5":16.3,"6":118,"7":3.2,"8":3.0,"9":0.26,"10":2.03,"11":6.38,"12":0.94,"13":3.31,"14":970},{"0":57.0,"1":1,"2":13.29,"3":1.97,"4":2.68,"5":16.8,"6":102,"7":3.0,"8":3.23,"9":0.31,"10":1.66,"11":6.0,"12":1.07,"13":2.84,"14":1270},{"0":58.0,"1":1,"2":13.72,"3":1.43,"4":2.5,"5":16.7,"6":108,"7":3.4,"8":3.67,"9":0.19,"10":2.04,"11":6.8,"12":0.89,"13":2.87,"14":1285},{"0":59.0,"1":2,"2":12.37,"3":0.94,"4":1.36,"5":10.6,"6":88,"7":1.98,"8":0.57,"9":0.28,"10":0.42,"11":1.95,"12":1.05,"13":1.82,"14":520},{"0":60.0,"1":2,"2":12.33,"3":1.1,"4":2.28,"5":16.0,"6":101,"7":2.05,"8":1.09,"9":0.63,"10":0.41,"11":3.27,"12":1.25,"13":1.67,"14":680},{"0":61.0,"1":2,"2":12.64,"3":1.36,"4":2.02,"5":16.8,"6":100,"7":2.02,"8":1.41,"9":0.53,"10":0.62,"11":5.75,"12":0.98,"13":1.59,"14":450},{"0":62.0,"1":2,"2":13.67,"3":1.25,"4":1.92,"5":18.0,"6":94,"7":2.1,"8":1.79,"9":0.32,"10":0.73,"11":3.8,"12":1.23,"13":2.46,"14":630},{"0":63.0,"1":2,"2":12.37,"3":1.13,"4":2.16,"5":19.0,"6":87,"7":3.5,"8":3.1,"9":0.19,"10":1.87,"11":4.45,"12":1.22,"13":2.87,"14":420},{"0":64.0,"1":2,"2":12.17,"3":1.45,"4":2.53,"5":19.0,"6":104,"7":1.89,"8":1.75,"9":0.45,"10":1.03,"11":2.95,"12":1.45,"13":2.23,"14":355},{"0":65.0,"1":2,"2":12.37,"3":1.21,"4":2.56,"5":18.1,"6":98,"7":2.42,"8":2.65,"9":0.37,"10":2.08,"11":4.6,"12":1.19,"13":2.3,"14":678},{"0":66.0,"1":2,"2":13.11,"3":1.01,"4":1.7,"5":15.0,"6":78,"7":2.98,"8":3.18,"9":0.26,"10":2.28,"11":5.3,"12":1.12,"13":3.18,"14":502},{"0":67.0,"1":2,"2":12.37,"3":1.17,"4":1.92,"5":19.6,"6":78,"7":2.11,"8":2.0,"9":0.27,"10":1.04,"11":4.68,"12":1.12,"13":3.48,"14":510},{"0":68.0,"1":2,"2":13.34,"3":0.94,"4":2.36,"5":17.0,"6":110,"7":2.53,"8":1.3,"9":0.55,"10":0.42,"11":3.17,"12":1.02,"13":1.93,"14":750},{"0":69.0,"1":2,"2":12.21,"3":1.19,"4":1.75,"5":16.8,"6":151,"7":1.85,"8":1.28,"9":0.14,"10":2.5,"11":2.85,"12":1.28,"13":3.07,"14":718},{"0":70.0,"1":2,"2":12.29,"3":1.61,"4":2.21,"5":20.4,"6":103,"7":1.1,"8":1.02,"9":0.37,"10":1.46,"11":3.05,"12":0.906,"13":1.82,"14":870},{"0":71.0,"1":2,"2":13.86,"3":1.51,"4":2.67,"5":25.0,"6":86,"7":2.95,"8":2.86,"9":0.21,"10":1.87,"11":3.38,"12":1.36,"13":3.16,"14":410},{"0":72.0,"1":2,"2":13.49,"3":1.66,"4":2.24,"5":24.0,"6":87,"7":1.88,"8":1.84,"9":0.27,"10":1.03,"11":3.74,"12":0.98,"13":2.78,"14":472},{"0":73.0,"1":2,"2":12.99,"3":1.67,"4":2.6,"5":30.0,"6":139,"7":3.3,"8":2.89,"9":0.21,"10":1.96,"11":3.35,"12":1.31,"13":3.5,"14":985},{"0":74.0,"1":2,"2":11.96,"3":1.09,"4":2.3,"5":21.0,"6":101,"7":3.38,"8":2.14,"9":0.13,"10":1.65,"11":3.21,"12":0.99,"13":3.13,"14":886},{"0":75.0,"1":2,"2":11.66,"3":1.88,"4":1.92,"5":16.0,"6":97,"7":1.61,"8":1.57,"9":0.34,"10":1.15,"11":3.8,"12":1.23,"13":2.14,"14":428},{"0":76.0,"1":2,"2":13.03,"3":0.9,"4":1.71,"5":16.0,"6":86,"7":1.95,"8":2.03,"9":0.24,"10":1.46,"11":4.6,"12":1.19,"13":2.48,"14":392},{"0":77.0,"1":2,"2":11.84,"3":2.89,"4":2.23,"5":18.0,"6":112,"7":1.72,"8":1.32,"9":0.43,"10":0.95,"11":2.65,"12":0.96,"13":2.52,"14":500},{"0":78.0,"1":2,"2":12.33,"3":0.99,"4":1.95,"5":14.8,"6":136,"7":1.9,"8":1.85,"9":0.35,"10":2.76,"11":3.4,"12":1.06,"13":2.31,"14":750},{"0":79.0,"1":2,"2":12.7,"3":3.87,"4":2.4,"5":23.0,"6":101,"7":2.83,"8":2.55,"9":0.43,"10":1.95,"11":2.57,"12":1.19,"13":3.13,"14":463},{"0":80.0,"1":2,"2":12.0,"3":0.92,"4":2.0,"5":19.0,"6":86,"7":2.42,"8":2.26,"9":0.3,"10":1.43,"11":2.5,"12":1.38,"13":3.12,"14":278},{"0":81.0,"1":2,"2":12.72,"3":1.81,"4":2.2,"5":18.8,"6":86,"7":2.2,"8":2.53,"9":0.26,"10":1.77,"11":3.9,"12":1.16,"13":3.14,"14":714},{"0":82.0,"1":2,"2":12.08,"3":1.13,"4":2.51,"5":24.0,"6":78,"7":2.0,"8":1.58,"9":0.4,"10":1.4,"11":2.2,"12":1.31,"13":2.72,"14":630},{"0":83.0,"1":2,"2":13.05,"3":3.86,"4":2.32,"5":22.5,"6":85,"7":1.65,"8":1.59,"9":0.61,"10":1.62,"11":4.8,"12":0.84,"13":2.01,"14":515},{"0":84.0,"1":2,"2":11.84,"3":0.89,"4":2.58,"5":18.0,"6":94,"7":2.2,"8":2.21,"9":0.22,"10":2.35,"11":3.05,"12":0.79,"13":3.08,"14":520},{"0":85.0,"1":2,"2":12.67,"3":0.98,"4":2.24,"5":18.0,"6":99,"7":2.2,"8":1.94,"9":0.3,"10":1.46,"11":2.62,"12":1.23,"13":3.16,"14":450},{"0":86.0,"1":2,"2":12.16,"3":1.61,"4":2.31,"5":22.8,"6":90,"7":1.78,"8":1.69,"9":0.43,"10":1.56,"11":2.45,"12":1.33,"13":2.26,"14":495},{"0":87.0,"1":2,"2":11.65,"3":1.67,"4":2.62,"5":26.0,"6":88,"7":1.92,"8":1.61,"9":0.4,"10":1.34,"11":2.6,"12":1.36,"13":3.21,"14":562},{"0":88.0,"1":2,"2":11.64,"3":2.06,"4":2.46,"5":21.6,"6":84,"7":1.95,"8":1.69,"9":0.48,"10":1.35,"11":2.8,"12":1.0,"13":2.75,"14":680},{"0":89.0,"1":2,"2":12.08,"3":1.33,"4":2.3,"5":23.6,"6":70,"7":2.2,"8":1.59,"9":0.42,"10":1.38,"11":1.74,"12":1.07,"13":3.21,"14":625},{"0":90.0,"1":2,"2":12.08,"3":1.83,"4":2.32,"5":18.5,"6":81,"7":1.6,"8":1.5,"9":0.52,"10":1.64,"11":2.4,"12":1.08,"13":2.27,"14":480},{"0":91.0,"1":2,"2":12.0,"3":1.51,"4":2.42,"5":22.0,"6":86,"7":1.45,"8":1.25,"9":0.5,"10":1.63,"11":3.6,"12":1.05,"13":2.65,"14":450},{"0":92.0,"1":2,"2":12.69,"3":1.53,"4":2.26,"5":20.7,"6":80,"7":1.38,"8":1.46,"9":0.58,"10":1.62,"11":3.05,"12":0.96,"13":2.06,"14":495},{"0":93.0,"1":2,"2":12.29,"3":2.83,"4":2.22,"5":18.0,"6":88,"7":2.45,"8":2.25,"9":0.25,"10":1.99,"11":2.15,"12":1.15,"13":3.3,"14":290},{"0":94.0,"1":2,"2":11.62,"3":1.99,"4":2.28,"5":18.0,"6":98,"7":3.02,"8":2.26,"9":0.17,"10":1.35,"11":3.25,"12":1.16,"13":2.96,"14":345},{"0":95.0,"1":2,"2":12.47,"3":1.52,"4":2.2,"5":19.0,"6":162,"7":2.5,"8":2.27,"9":0.32,"10":3.28,"11":2.6,"12":1.16,"13":2.63,"14":937},{"0":96.0,"1":2,"2":11.81,"3":2.12,"4":2.74,"5":21.5,"6":134,"7":1.6,"8":0.99,"9":0.14,"10":1.56,"11":2.5,"12":0.95,"13":2.26,"14":625},{"0":97.0,"1":2,"2":12.29,"3":1.41,"4":1.98,"5":16.0,"6":85,"7":2.55,"8":2.5,"9":0.29,"10":1.77,"11":2.9,"12":1.23,"13":2.74,"14":428},{"0":98.0,"1":2,"2":12.37,"3":1.07,"4":2.1,"5":18.5,"6":88,"7":3.52,"8":3.75,"9":0.24,"10":1.95,"11":4.5,"12":1.04,"13":2.77,"14":660},{"0":99.0,"1":2,"2":12.29,"3":3.17,"4":2.21,"5":18.0,"6":88,"7":2.85,"8":2.99,"9":0.45,"10":2.81,"11":2.3,"12":1.42,"13":2.83,"14":406},{"0":100.0,"1":2,"2":12.08,"3":2.08,"4":1.7,"5":17.5,"6":97,"7":2.23,"8":2.17,"9":0.26,"10":1.4,"11":3.3,"12":1.27,"13":2.96,"14":710},{"0":101.0,"1":2,"2":12.6,"3":1.34,"4":1.9,"5":18.5,"6":88,"7":1.45,"8":1.36,"9":0.29,"10":1.35,"11":2.45,"12":1.04,"13":2.77,"14":562},{"0":102.0,"1":2,"2":12.34,"3":2.45,"4":2.46,"5":21.0,"6":98,"7":2.56,"8":2.11,"9":0.34,"10":1.31,"11":2.8,"12":0.8,"13":3.38,"14":438},{"0":103.0,"1":2,"2":11.82,"3":1.72,"4":1.88,"5":19.5,"6":86,"7":2.5,"8":1.64,"9":0.37,"10":1.42,"11":2.06,"12":0.94,"13":2.44,"14":415},{"0":104.0,"1":2,"2":12.51,"3":1.73,"4":1.98,"5":20.5,"6":85,"7":2.2,"8":1.92,"9":0.32,"10":1.48,"11":2.94,"12":1.04,"13":3.57,"14":672},{"0":105.0,"1":2,"2":12.42,"3":2.55,"4":2.27,"5":22.0,"6":90,"7":1.68,"8":1.84,"9":0.66,"10":1.42,"11":2.7,"12":0.86,"13":3.3,"14":315},{"0":106.0,"1":2,"2":12.25,"3":1.73,"4":2.12,"5":19.0,"6":80,"7":1.65,"8":2.03,"9":0.37,"10":1.63,"11":3.4,"12":1.0,"13":3.17,"14":510},{"0":107.0,"1":2,"2":12.72,"3":1.75,"4":2.28,"5":22.5,"6":84,"7":1.38,"8":1.76,"9":0.48,"10":1.63,"11":3.3,"12":0.88,"13":2.42,"14":488},{"0":108.0,"1":2,"2":12.22,"3":1.29,"4":1.94,"5":19.0,"6":92,"7":2.36,"8":2.04,"9":0.39,"10":2.08,"11":2.7,"12":0.86,"13":3.02,"14":312},{"0":109.0,"1":2,"2":11.61,"3":1.35,"4":2.7,"5":20.0,"6":94,"7":2.74,"8":2.92,"9":0.29,"10":2.49,"11":2.65,"12":0.96,"13":3.26,"14":680},{"0":110.0,"1":2,"2":11.46,"3":3.74,"4":1.82,"5":19.5,"6":107,"7":3.18,"8":2.58,"9":0.24,"10":3.58,"11":2.9,"12":0.75,"13":2.81,"14":562},{"0":111.0,"1":2,"2":12.52,"3":2.43,"4":2.17,"5":21.0,"6":88,"7":2.55,"8":2.27,"9":0.26,"10":1.22,"11":2.0,"12":0.9,"13":2.78,"14":325},{"0":112.0,"1":2,"2":11.76,"3":2.68,"4":2.92,"5":20.0,"6":103,"7":1.75,"8":2.03,"9":0.6,"10":1.05,"11":3.8,"12":1.23,"13":2.5,"14":607},{"0":113.0,"1":2,"2":11.41,"3":0.74,"4":2.5,"5":21.0,"6":88,"7":2.48,"8":2.01,"9":0.42,"10":1.44,"11":3.08,"12":1.1,"13":2.31,"14":434},{"0":114.0,"1":2,"2":12.08,"3":1.39,"4":2.5,"5":22.5,"6":84,"7":2.56,"8":2.29,"9":0.43,"10":1.04,"11":2.9,"12":0.93,"13":3.19,"14":385},{"0":115.0,"1":2,"2":11.03,"3":1.51,"4":2.2,"5":21.5,"6":85,"7":2.46,"8":2.17,"9":0.52,"10":2.01,"11":1.9,"12":1.71,"13":2.87,"14":407},{"0":116.0,"1":2,"2":11.82,"3":1.47,"4":1.99,"5":20.8,"6":86,"7":1.98,"8":1.6,"9":0.3,"10":1.53,"11":1.95,"12":0.95,"13":3.33,"14":495},{"0":117.0,"1":2,"2":12.42,"3":1.61,"4":2.19,"5":22.5,"6":108,"7":2.0,"8":2.09,"9":0.34,"10":1.61,"11":2.06,"12":1.06,"13":2.96,"14":345},{"0":118.0,"1":2,"2":12.77,"3":3.43,"4":1.98,"5":16.0,"6":80,"7":1.63,"8":1.25,"9":0.43,"10":0.83,"11":3.4,"12":0.7,"13":2.12,"14":372},{"0":119.0,"1":2,"2":12.0,"3":3.43,"4":2.0,"5":19.0,"6":87,"7":2.0,"8":1.64,"9":0.37,"10":1.87,"11":1.28,"12":0.93,"13":3.05,"14":564},{"0":120.0,"1":2,"2":11.45,"3":2.4,"4":2.42,"5":20.0,"6":96,"7":2.9,"8":2.79,"9":0.32,"10":1.83,"11":3.25,"12":0.8,"13":3.39,"14":625},{"0":121.0,"1":2,"2":11.56,"3":2.05,"4":3.23,"5":28.5,"6":119,"7":3.18,"8":5.08,"9":0.47,"10":1.87,"11":6.0,"12":0.93,"13":3.69,"14":465},{"0":122.0,"1":2,"2":12.42,"3":4.43,"4":2.73,"5":26.5,"6":102,"7":2.2,"8":2.13,"9":0.43,"10":1.71,"11":2.08,"12":0.92,"13":3.12,"14":365},{"0":123.0,"1":2,"2":13.05,"3":5.8,"4":2.13,"5":21.5,"6":86,"7":2.62,"8":2.65,"9":0.3,"10":2.01,"11":2.6,"12":0.73,"13":3.1,"14":380},{"0":124.0,"1":2,"2":11.87,"3":4.31,"4":2.39,"5":21.0,"6":82,"7":2.86,"8":3.03,"9":0.21,"10":2.91,"11":2.8,"12":0.75,"13":3.64,"14":380},{"0":125.0,"1":2,"2":12.07,"3":2.16,"4":2.17,"5":21.0,"6":85,"7":2.6,"8":2.65,"9":0.37,"10":1.35,"11":2.76,"12":0.86,"13":3.28,"14":378},{"0":126.0,"1":2,"2":12.43,"3":1.53,"4":2.29,"5":21.5,"6":86,"7":2.74,"8":3.15,"9":0.39,"10":1.77,"11":3.94,"12":0.69,"13":2.84,"14":352},{"0":127.0,"1":2,"2":11.79,"3":2.13,"4":2.78,"5":28.5,"6":92,"7":2.13,"8":2.24,"9":0.58,"10":1.76,"11":3.0,"12":0.97,"13":2.44,"14":466},{"0":128.0,"1":2,"2":12.37,"3":1.63,"4":2.3,"5":24.5,"6":88,"7":2.22,"8":2.45,"9":0.4,"10":1.9,"11":2.12,"12":0.89,"13":2.78,"14":342},{"0":129.0,"1":2,"2":12.04,"3":4.3,"4":2.38,"5":22.0,"6":80,"7":2.1,"8":1.75,"9":0.42,"10":1.35,"11":2.6,"12":0.79,"13":2.57,"14":580},{"0":130.0,"1":3,"2":12.86,"3":1.35,"4":2.32,"5":18.0,"6":122,"7":1.51,"8":1.25,"9":0.21,"10":0.94,"11":4.1,"12":0.76,"13":1.29,"14":630},{"0":131.0,"1":3,"2":12.88,"3":2.99,"4":2.4,"5":20.0,"6":104,"7":1.3,"8":1.22,"9":0.24,"10":0.83,"11":5.4,"12":0.74,"13":1.42,"14":530},{"0":132.0,"1":3,"2":12.81,"3":2.31,"4":2.4,"5":24.0,"6":98,"7":1.15,"8":1.09,"9":0.27,"10":0.83,"11":5.7,"12":0.66,"13":1.36,"14":560},{"0":133.0,"1":3,"2":12.7,"3":3.55,"4":2.36,"5":21.5,"6":106,"7":1.7,"8":1.2,"9":0.17,"10":0.84,"11":5.0,"12":0.78,"13":1.29,"14":600},{"0":134.0,"1":3,"2":12.51,"3":1.24,"4":2.25,"5":17.5,"6":85,"7":2.0,"8":0.58,"9":0.6,"10":1.25,"11":5.45,"12":0.75,"13":1.51,"14":650},{"0":135.0,"1":3,"2":12.6,"3":2.46,"4":2.2,"5":18.5,"6":94,"7":1.62,"8":0.66,"9":0.63,"10":0.94,"11":7.1,"12":0.73,"13":1.58,"14":695},{"0":136.0,"1":3,"2":12.25,"3":4.72,"4":2.54,"5":21.0,"6":89,"7":1.38,"8":0.47,"9":0.53,"10":0.8,"11":3.85,"12":0.75,"13":1.27,"14":720},{"0":137.0,"1":3,"2":12.53,"3":5.51,"4":2.64,"5":25.0,"6":96,"7":1.79,"8":0.6,"9":0.63,"10":1.1,"11":5.0,"12":0.82,"13":1.69,"14":515},{"0":138.0,"1":3,"2":13.49,"3":3.59,"4":2.19,"5":19.5,"6":88,"7":1.62,"8":0.48,"9":0.58,"10":0.88,"11":5.7,"12":0.81,"13":1.82,"14":580},{"0":139.0,"1":3,"2":12.84,"3":2.96,"4":2.61,"5":24.0,"6":101,"7":2.32,"8":0.6,"9":0.53,"10":0.81,"11":4.92,"12":0.89,"13":2.15,"14":590},{"0":140.0,"1":3,"2":12.93,"3":2.81,"4":2.7,"5":21.0,"6":96,"7":1.54,"8":0.5,"9":0.53,"10":0.75,"11":4.6,"12":0.77,"13":2.31,"14":600},{"0":141.0,"1":3,"2":13.36,"3":2.56,"4":2.35,"5":20.0,"6":89,"7":1.4,"8":0.5,"9":0.37,"10":0.64,"11":5.6,"12":0.7,"13":2.47,"14":780},{"0":142.0,"1":3,"2":13.52,"3":3.17,"4":2.72,"5":23.5,"6":97,"7":1.55,"8":0.52,"9":0.5,"10":0.55,"11":4.35,"12":0.89,"13":2.06,"14":520},{"0":143.0,"1":3,"2":13.62,"3":4.95,"4":2.35,"5":20.0,"6":92,"7":2.0,"8":0.8,"9":0.47,"10":1.02,"11":4.4,"12":0.91,"13":2.05,"14":550},{"0":144.0,"1":3,"2":12.25,"3":3.88,"4":2.2,"5":18.5,"6":112,"7":1.38,"8":0.78,"9":0.29,"10":1.14,"11":8.21,"12":0.65,"13":2.0,"14":855},{"0":145.0,"1":3,"2":13.16,"3":3.57,"4":2.15,"5":21.0,"6":102,"7":1.5,"8":0.55,"9":0.43,"10":1.3,"11":4.0,"12":0.6,"13":1.68,"14

# Reading HTML Content

In [253]:
# url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'

# dfs = pd.read_html(url)

# Reading Excel Files

In [255]:
df_excel = pd.read_excel("Excel_Sample.xlsx")

In [256]:
df_excel.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Pickling

In [257]:
df_excel.to_pickle('df_excel')

In [258]:
df = pd.read_pickle('df_excel')

In [259]:
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15